:PROPERTIES:
:ID:       03cc924b-b9f8-4d17-bb01-6142fa69ef72
:END:
#+TITLE: Testing a Kubernetes CLI tool
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes

I'm testing a [[https://github.com/Konubinix/clk][clk]] extension that manages Kubernetes clusters via
[[https://kind.sigs.k8s.io/][Kind]]. The integration tests need to create a real Kind cluster, which
means Docker must be running inside the CI container. daggerlib's
Docker-in-Docker support handles the daemon lifecycle — cgroup v2
setup, tmpfs mounts, dockerd startup — so I can focus on my tests.

The real test flow (from the [[https://github.com/Konubinix/daggerlib/blob/main/examples/docker_in_docker][project's Earthfile]]) installs Kind,
creates a cluster, deploys an app, and runs assertions. Here I show
how daggerlib provides the DinD foundation those tests build on.

This example calls daggerlib functions directly — useful for
exploring what a function does before wrapping it in your own module.

First I set up my Dagger project and install daggerlib:

#+begin_src bash :eval no-export :init yes
dagger init --sdk=python
dagger install github.com/Konubinix/daggerlib
#+end_src

#+RESULTS[c4efdd5f981c9514f8ec08a7690bee71d70c7f38]:

The following is only for testing purposes — it makes the project
use the local daggerlib checkout instead of the published version:

#+begin_src bash :eval no-export :init yes
sed -i '/pin/d; s|"github.com/Konubinix/daggerlib@main"|"../.."|; s|"\.\./\.\.",|"../.."|' dagger.json
#+end_src

#+RESULTS[c0e43fe49406c11e84dec1670d2236fec6890c1b]:

Then I write my Dagger module. The =<<...>>= reference below is
filled in by the function definition that follows — it shows the
function code and its output:

#+begin_src python :tangle .dagger/src/docker_in_docker/main.py :noweb yes
from typing import Annotated

import dagger
from dagger import DefaultPath, dag, function, object_type


@object_type
class DockerInDocker:
    <<test-kind>>
#+end_src

* Running a command with a live Docker daemon

  Having Docker installed isn't enough — I need a running =dockerd=.
  The =dind-with-docker= target starts the daemon with proper cgroup
  v2 setup, then runs my command. In production I'd run Kind here;
  for this example I mock the workflow:

  #+NAME: test-kind
  #+begin_src python
  @function
  async def test_kind(self) -> str:
      """Run a mocked Kind workflow inside Docker-in-Docker."""
      return await (
          dag.lib().dind_with_docker(
              cmd="kind() { echo 'Creating cluster...'; echo \"Cluster 'test' created.\"; };"
              " kubectl() { echo 'NAME            STATUS   ROLES           AGE';"
              " echo 'test-node       Ready    control-plane   1m'; };"
              " export -f kind kubectl;"
              " kind create cluster --wait 60s && kubectl get nodes",
          )
          .stdout()
      )
  #+end_src

  #+NAME: dind_test_kind
  #+begin_src bash :tangle tests/commands/dind_test_kind :mkdirp yes :comments no :padline no
  dagger call test-kind
  #+end_src

  #+RESULTS[a8f56b1c4cf5070eca3245c06611ab8a1f0b7940]: dind_test_kind
  : Creating cluster...
  : Cluster 'test' created.
  : NAME            STATUS   ROLES           AGE
  : test-node       Ready    control-plane   1m

  #+BEGIN_SRC org :tangle tests/expected/dind_test_kind :mkdirp yes :noweb yes :exports none :comments no :padline no
  <<dind_test_kind()>>
  #+END_SRC
